/**
  *************************************************************************************************************************
  * @file    myconfig.h
  * @author  LiuHongMing
  * @version V1.0
  * @date    2022-01-15
  * @brief   蓝桥嵌入式开发板外设引脚，配置参数,头文件
  *************************************************************************************************************************
  * @attention
  * 
  * 
  * 
  *************************************************************************************************************************
  */


/* Define to prevent recursive inclusion --------------------------------------------------------------------------------*/
#ifndef __MYCONFIG_H
#define	__MYCONFIG_H

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "bsp_led.h"
#include "bsp_key.h"
#include "bsp_adc.h"
#include "delay.h"
#include "lcd.h"
#include "pwm.h"
#include "tim.h"
#include "stdio.h"
/* 定义 -----------------------------------------------------------------------------------------------------------------*/
#define DATA    (0)
#define PARAM   (1)

#define AUTO    (0)
#define MANU    (1)

typedef struct
{
	uint8_t  PA6_Duty;//PA6占空比
	uint8_t  PA7_Duty;//PA7占空比
	uint8_t  AUTO_Duty;//自动模式占空比
	uint8_t  Interface;//Lcd界面
	uint8_t  Model;//运行模式
	uint16_t VoltValue;//电压测量值
}VoltagePulse;

VoltagePulse System;



/* 提供给其他C文件调用的函数 --------------------------------------------------------------------------------------------*/

#endif /* __MYCONFIG_H */

/*****************************************************END OF FILE*********************************************************/	
