/**
  *************************************************************************************************************************
  * @file    digital.h
  * @author  LiuHongMing
  * @version V1.0
  * @date    2022-01-10
  * @brief   蓝桥嵌入式扩展板数码管模块头文件配置
  *************************************************************************************************************************
  * @attention
  * 
  * 
  * 
  *************************************************************************************************************************
  */


/* Define to prevent recursive inclusion --------------------------------------------------------------------------------*/
#ifndef __BSP_DIGITAL_H
#define	__BSP_DIGITAL_H

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "stm32f10x.h"

/* 定义 -----------------------------------------------------------------------------------------------------------------*/
#define SER_H GPIO_SetBits(GPIOA,GPIO_Pin_1);
#define SER_L GPIO_ResetBits(GPIOA,GPIO_Pin_1);

#define RCK_H GPIO_SetBits(GPIOA,GPIO_Pin_2);
#define RCK_L GPIO_ResetBits(GPIOA,GPIO_Pin_2);

#define SCK_H GPIO_SetBits(GPIOA,GPIO_Pin_3);
#define SCK_L GPIO_ResetBits(GPIOA,GPIO_Pin_3);


/* 提供给其他C文件调用的函数 --------------------------------------------------------------------------------------------*/
void Seg_Init(void);
void Seg_Display(uint8_t bit1,uint8_t bit2,uint8_t bit3);



#endif /* __BSP_DIGITAL_H */

/*****************************************************END OF FILE*********************************************************/	
