/**
  *************************************************************************************************************************
  * @file    adc_key.h
  * @author  LiuHongMing
  * @version V1.0
  * @date    2022-01-20
  * @brief   蓝桥杯嵌入式扩展板AD按键模块头文件配置
  *************************************************************************************************************************
  * @attention
  * 
  * 
  * 
  *************************************************************************************************************************
  */


/* Define to prevent recursive inclusion --------------------------------------------------------------------------------*/
#ifndef __BSP_ADC_KEY_H
#define	__BSP_ADC_KEY_H

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "bsp_adc.h" 
 #include "bsp_AnalogVoltage.h"
/* 定义 -----------------------------------------------------------------------------------------------------------------*/
#define FALSE (0)
#define TRUE  (1)

/********************当前设置的按键扫描中断为 1*5MS************/
#define KEY_LONGSTATUS_Time  100  // 判定长按时间
#define KEY_EliShaking_Time   2   // 按键消抖值
#define Key_LongTimeSet       5  //  按键长按后多久更新一次 比如长按后加一，本设置为多久加一

typedef struct
{		
	uint8_t Value;       //使用数据后及时清除到0xff ！！！
	uint8_t ShortPress;  //使用数据后及时清除到FAUSE状态！！！
	uint8_t LongPress;   //判断长按否？ 不需要认为清除
	uint8_t LongFresh;   //长按刷新，长按多久按键计算快速累加或累减一次使用数据后及时清除到FAUSE状态！！！！
	uint8_t Touch;       //按键是否按下
}KEY_TypeDef;
extern KEY_TypeDef Key; 
/* 提供给其他C文件调用的函数 --------------------------------------------------------------------------------------------*/
extern uint8_t Adc_Key_Read(void);
extern void Key_Interrup(void);

#endif /* __BSP_ADC_KEY_H */

/*****************************************************END OF FILE*********************************************************/	
