/**
  *************************************************************************************************************************
  * @file    adc.h
  * @author  LiuHongMing
  * @version V1.0
  * @date    2022-01-20
  * @brief   蓝桥杯嵌入式开发板ADC模块头文件配置
  *************************************************************************************************************************
  * @attention
  * 
  * 
  * 
  *************************************************************************************************************************
  */
/* Define to prevent recursive inclusion --------------------------------------------------------------------------------*/
#ifndef __BSP_ADC_H
#define	__BSP_ADC_H

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "stm32f10x.h"

/* 定义 -----------------------------------------------------------------------------------------------------------------*/
// ADC 编号选择
// 可以是 ADC1/2，如果使用ADC3，中断相关的要改成ADC3的
#define    ADCx                          ADC1
#define    ADC_CLK                       RCC_APB2Periph_ADC1

// ADC GPIO宏定义
// 注意：用作ADC采集的IO必须没有复用，否则采集电压会有影响
#define    ADC_GPIO_CLK                  RCC_APB2Periph_GPIOA  
#define    ADC_PORT                      GPIOA
#define    ADC_PIN                       (GPIO_Pin_4 | GPIO_Pin_5)

// ADC 中断相关宏定义
#define    ADC_IRQ                       ADC1_2_IRQn
#define    ADC_IRQHandler                ADC1_2_IRQHandler

#define ADC1_DR_Address    ((uint32_t)0x4001244C)

// 转换通道个数
#define    NOFCHANEL	 2
// ADC1转换的电压值通过DMA方式传到SRAM
/* 提供给其他C文件调用的函数 --------------------------------------------------------------------------------------------*/
extern __IO uint16_t ADC_ConvertedValue[NOFCHANEL]; 
extern void ADCx_Init(void);
#endif /* __BSP_ADC_H */

/*****************************************************END OF FILE*********************************************************/	

