/* Define to prevent recursive inclusion --------------------------------------------------------------------------------*/
#ifndef __DELAY_H
#define	__DELAY_H

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "stm32f10x.h"

/* 定义 -----------------------------------------------------------------------------------------------------------------*/
#define delay 		Delay_Ms
#define delay_ms 	Delay_Ms

/* 提供给其他C文件调用的函数 --------------------------------------------------------------------------------------------*/
void Delay_Init(void);         /* 延时函数初始化    */
void Delay_Ms(uint32_t nTime); /* 延时nMs的延时函数 */
void SysTick_Handler(void);    /* 定时器中断处理    */
void Delay_10ms(void);         /* 延时10ms函数      */

#endif /* __DELAY_H */

/*****************************************************END OF FILE*********************************************************/	
